scripts/sabotage/hud-skip-writer-emission.patch
diff --git a/src/Puck.Overlays/HudWriter.cs b/src/Puck.Overlays/HudWriter.cs
index 8d55fe9d..a9d09667 100644
--- a/src/Puck.Overlays/HudWriter.cs
+++ b/src/Puck.Overlays/HudWriter.cs
@@ -71,9 +71,18 @@ public bool HasReplace {
     /// <param name="builder">The frame builder.</param>
     public void EmitOver(OverlayFrameBuilder builder) => EmitBand(builder: builder, band: OverlayHudBand.Over);
 
+    // SABOTAGE-INJECTED: forces every HUD emission to skip for docs/verification/hud-document (temporary — never
+    // present outside that runner's sabotage patch). A static readonly (not a literal) so the compiler cannot prove
+    // the guard below unreachable and refuse the build over it.
+    private static readonly bool s_sabotageSkipEmission = true;
+
     private void EmitBand(OverlayFrameBuilder builder, OverlayHudBand band) {
         ArgumentNullException.ThrowIfNull(argument: builder);
 
+        if (s_sabotageSkipEmission) {
+            return;
+        }
+
         if (!m_hasFrame) {
             return;
         }
